---
kind: type
id: T:Autodesk.Revit.DB.AssemblyMemberDifferentParameters
source: html/bff4df0d-ea29-c280-f4ad-47214fa7d126.htm
---
# Autodesk.Revit.DB.AssemblyMemberDifferentParameters

The two assembly members being compared have different parameters

## Syntax (C#)
```csharp
public class AssemblyMemberDifferentParameters : AssemblyMemberDifference
```